Revit 2026 API

# OrdinateOriginVisibility Enumeration

---

The ordinate origin visibility.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum OrdinateOriginVisibility
```
```vb
Public Enumeration OrdinateOriginVisibility
```
```cpp
public enum class OrdinateOriginVisibility
```
```fsharp
type OrdinateOriginVisibility
```

| Member name | Value | Description |
| --- | --- | --- |
| None | 0 | Does not show the origin witness line, tick mark, or text (0'-0"). |
| WitnessLineOnly | 2 | Shows the origin witness line and tick mark. |
| WitnessLineWithText | 1 | Shows the origin witness line, tick mark and text (0'-0"). |

#### Reference

Autodesk.Revit.DB Namespace